# LEET CODE
## Problem-1978: Employees Whose Manager Left the Company

Class: Easy

Source: https://leetcode.com/problems/employees-whose-manager-left-the-company/

## Description
Table: Employees

| Column Name | Type     |
|-------------|----------|
| employee_id | int      |
| name        | varchar  |
| manager_id  | int      |
| salary      | int      |

In SQL, employee_id is the primary key for this table.

This table contains information about the employees, their salary, and the ID of their manager. Some employees do not have a manager (manager_id is null). 

## To Do
Find the IDs of the employees whose salary is strictly less than $30000 and whose manager left the company. When a manager leaves the company, their information is deleted from the Employees table, but the reports still have their manager_id set to the manager that left.

Return the result table ordered by employee_id.

The result format is in the following example.

## Example

Input:  

Employees table:
| employee_id | name      | manager_id | salary |
|-------------|-----------|------------|--------|
| 3           | Mila      | 9          | 60301  |
| 12          | Antonella | null       | 31000  |
| 13          | Emery     | null       | 67084  |
| 1           | Kalel     | 11         | 21241  |
| 9           | Mikaela   | null       | 50937  |
| 11          | Joziah    | 6          | 28485  |

Output: 
| employee_id |
|-------------|
| 11          |

Explanation: 
- The employees with a salary less than $30000 are 1 (Kalel) and 11 (Joziah).
- Kalel's manager is employee 11, who is still in the company (Joziah).
- Joziah's manager is employee 6, who left the company because there is no row for employee 6 as it was deleted.

## Importing

In [1]:
import pandas as pd
from pandasql import sqldf

## Define Schema

In [2]:
data = [[3, 'Mila', 9, 60301], [12, 'Antonella', None, 31000], [13, 'Emery', None, 67084], [1, 'Kalel', 11, 21241], [9, 'Mikaela', None, 50937], [11, 'Joziah', 6, 28485]]
Employees = pd.DataFrame(data, columns=['employee_id', 'name', 'manager_id', 'salary']).astype({'employee_id':'Int64', 'name':'object', 'manager_id':'Int64', 'salary':'Int64'})

In [3]:
Employees

   employee_id       name  manager_id  salary
0            3       Mila           9   60301
1           12  Antonella        <NA>   31000
2           13      Emery        <NA>   67084
3            1      Kalel          11   21241
4            9    Mikaela        <NA>   50937
5           11     Joziah           6   28485

## Task

In [7]:
# Define the SQL query
query = """
SELECT employee_id
FROM Employees
WHERE salary < 30000
AND manager_id NOT IN (SELECT employee_id FROM Employees)
ORDER BY employee_id ASC
;
"""

# Excute the query using pandasql
result = sqldf(query, env={'Employees':Employees})

# Dipslay the results dataframe
display(result)

   employee_id
0           11